init.org
#+TITLE: Minimal Emacs Configuration (Emacs 30)
#+AUTHOR: Yojan Gautam
#+EMAIL: gautamyojan0@gmail.com
#+OPTIONS: num:nil toc:nil
#+PROPERTY: header-args:emacs-lisp :tangle init.el

* Early Initialization

#+begin_src emacs-lisp :tangle early-init.el
;; -*- lexical-binding: t; -*-

;; Fix seq-empty-p for Emacs 30 + Evil compatibility
(require 'cl-lib)
(require 'seq)
(cl-defmethod seq-empty-p ((_ symbol)) nil)

;; Prevent package.el (we use straight.el)
(setq package-enable-at-startup nil)

;; Native compilation
(when (featurep 'native-compile)
  (setq native-comp-async-report-warnings-errors nil
        native-comp-deferred-compilation t
        native-compile-prune-cache t))

;; GC: high during init, reasonable after
(setq gc-cons-threshold most-positive-fixnum)
(add-hook 'emacs-startup-hook
          (lambda () (setq gc-cons-threshold (* 20 1024 1024))))

;; Disable UI early
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))

(setq inhibit-startup-message t
      inhibit-splash-screen t
      initial-scratch-message nil
      frame-inhibit-implied-resize t)
#+end_src

* Core Setup
#+begin_src emacs-lisp
;; -*- lexical-binding: t -*-

;; Belt-and-suspenders seq fix
(require 'cl-lib)
(require 'seq)
(unless (ignore-errors (seq-empty-p 'test-symbol))
  (cl-defmethod seq-empty-p ((_ symbol)) nil))

;; ── Bootstrap straight.el ──
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t
      use-package-always-ensure t
      straight-built-in-pseudo-packages
      '(emacs nadvice python eldoc project org seq cl-lib))

(require 'org)
(require 'org-tempo)

;; ── Defaults ──
(setq-default ring-bell-function 'ignore
              column-number-mode t
              indent-tabs-mode nil
              tab-width 4
              fill-column 80)
(show-paren-mode 1)
(delete-selection-mode 1)
(global-auto-revert-mode 1)
(savehist-mode 1)

;; Recent files
(recentf-mode 1)
(setq recentf-max-saved-items 100
      recentf-auto-cleanup 'never)
(run-at-time nil (* 5 60) 'recentf-save-list)

;; Backups & auto-save
(let ((backup-dir (expand-file-name ".cache/backups" user-emacs-directory))
      (auto-save-dir (expand-file-name ".cache/auto-save" user-emacs-directory)))
  (make-directory backup-dir t)
  (make-directory auto-save-dir t)
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-save-dir t))
        backup-by-copying t
        delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t
        create-lockfiles nil))

;; PATH from shell (macOS)
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns x))
  :config (exec-path-from-shell-initialize))

;; Performance
(setq read-process-output-max (* 1024 1024))

(defun my-reload-init-file ()
  "Reload init file."
  (interactive)
  (load-file user-init-file)
  (message "Emacs init file reloaded!"))
#+end_src

* UI
#+begin_src emacs-lisp
;; ── Font ──
(when (display-graphic-p)
  (ignore-errors
    (set-face-attribute 'default nil :font "Iosevka Nerd Font Mono-18")))

(use-package mixed-pitch
  :hook ((org-mode LaTeX-mode latex-mode) . mixed-pitch-mode)
  :config
  (set-face-attribute 'variable-pitch nil :family "Georgia" :height 130)
  (set-face-attribute 'fixed-pitch nil :family "Iosevka Nerd Font Mono" :height 130)
  (dolist (face '(font-latex-math-face font-latex-sedate-face
                  font-latex-warning-face font-latex-verbatim-face
                  font-latex-script-char-face))
    (add-to-list 'mixed-pitch-fixed-pitch-faces face)))

;; ── Theme ──
(defun my/sync-theme-with-system (appearance)
  "Switch timu-macos flavour based on system APPEARANCE."
  (mapc #'disable-theme custom-enabled-themes)
  (customize-set-variable 'timu-macos-flavour
                          (if (eq appearance 'dark) "dark" "light"))
  (load-theme 'timu-macos t))

(when (boundp 'ns-system-appearance-change-functions)
  (add-hook 'ns-system-appearance-change-functions #'my/sync-theme-with-system))

(use-package timu-macos-theme
  :config (load-theme 'timu-macos t))

(dolist (pair '((timu-macos-scale-org-document-title . 1.2)
                (timu-macos-scale-org-document-info . 1.2)
                (timu-macos-scale-org-level-1 . 1.2)
                (timu-macos-scale-org-level-2 . 1.2)
                (timu-macos-scale-org-level-3 . 1.1)))
  (customize-set-variable (car pair) (cdr pair)))

;; ── Modeline ──
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :config (setq doom-modeline-height 25 doom-modeline-bar-width 3))

;; ── Undo-tree ──
(use-package undo-tree
  :demand t
  :config
  (let ((undo-dir (concat user-emacs-directory "undo-tree-hist/")))
    (make-directory undo-dir t)
    (setq undo-tree-history-directory-alist `(("." . ,undo-dir))))
  (global-undo-tree-mode))

;; ── Icons ──
(use-package all-the-icons :if (display-graphic-p) :defer t)
(use-package nerd-icons :if (display-graphic-p))

;; ── Dashboard ──
(use-package dashboard
  :demand t
  :config
  (setq dashboard-startup-banner 'logo
        dashboard-center-content t
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-items '((recents . 5) (projects . 10) (bookmarks . 5))
        dashboard-set-init-info t
        dashboard-set-footer nil)
  (dashboard-setup-startup-hook)

  (defun dashboard-goto-projects ()
    (interactive)
    (dashboard-refresh-buffer)
    (goto-char (point-min))
    (search-forward "Projects:" nil t))
  (defun dashboard-goto-recent-files ()
    (interactive)
    (dashboard-refresh-buffer)
    (goto-char (point-min))
    (search-forward "Recent Files:" nil t)))

;; ── Line numbers ──
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)
(dolist (mode '(org-mode-hook vterm-mode-hook term-mode-hook shell-mode-hook
                pdf-view-mode-hook eshell-mode-hook compilation-mode-hook
                dashboard-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode -1))))

;; ── Zen modes ──
(defun toggle-fullscreen ()
  (interactive)
  (set-frame-parameter nil 'fullscreen
                       (if (frame-parameter nil 'fullscreen) nil 'fullboth)))
(global-set-key (kbd "<f11>") 'toggle-fullscreen)

(use-package writeroom-mode
  :commands writeroom-mode
  :config
  (setq writeroom-width 100
        writeroom-mode-line t
        writeroom-bottom-divider-width 0
        writeroom-fullscreen-effect 'maximized
        writeroom-maximize-window t
        writeroom-extra-line-spacing 0.2))

(use-package olivetti
  :config
  (setq olivetti-body-width 100 olivetti-style 'fancy))

(use-package visual-fill-column :defer t)

(defun my-zen-mode ()
  (interactive)
  (if (bound-and-true-p writeroom-mode) (writeroom-mode -1) (writeroom-mode 1)))

(defun my-zen-mode-light ()
  (interactive)
  (if (bound-and-true-p olivetti-mode)
      (progn (olivetti-mode -1) (display-line-numbers-mode 1))
    (progn (olivetti-mode 1) (display-line-numbers-mode -1))))

(defun my-zen-mode-ultra ()
  (interactive)
  (if (bound-and-true-p writeroom-mode)
      (progn (writeroom-mode -1) (display-line-numbers-mode 1)
             (when (fboundp 'doom-modeline-mode) (doom-modeline-mode 1)))
    (progn (writeroom-mode 1) (display-line-numbers-mode -1)
           (when (fboundp 'doom-modeline-mode) (doom-modeline-mode -1)))))
#+end_src

* Evil Mode & Keybindings
#+begin_src emacs-lisp
(use-package which-key
  :demand t
  :config (which-key-mode) (setq which-key-idle-delay 0.3))

;; ── Ivy / Counsel / Swiper ──
(use-package ivy
  :demand t
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t
        ivy-count-format "(%d/%d) "
        ivy-height 15
        ivy-wrap t
        ivy-fixed-height-minibuffer t
        enable-recursive-minibuffers t
        ivy-initial-inputs-alist nil))

(use-package counsel
  :after ivy
  :config (counsel-mode 1))

(use-package swiper
  :after ivy
  :bind (("C-s" . swiper) ("C-r" . swiper-backward)))

(use-package ivy-rich
  :after ivy
  :config
  (ivy-rich-mode 1)
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line))

;; ── Evil ──
(use-package evil
  :demand t
  :init
  (setq evil-want-keybinding nil
        evil-want-integration t
        evil-undo-system 'undo-tree
        evil-respect-visual-line-mode t
        evil-want-C-u-scroll t
        evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-normal-state-map (kbd "C-u") 'evil-scroll-up)
  (define-key evil-visual-state-map (kbd "C-u") 'evil-scroll-up))

(use-package evil-collection
  :after evil
  :config (evil-collection-init))

;; ── Projectile ──
(use-package projectile
  :demand t
  :config
  (projectile-mode 1)
  (let ((cache-dir (expand-file-name ".cache" user-emacs-directory)))
    (make-directory cache-dir t)
    (setq projectile-completion-system 'ivy
          projectile-enable-caching t
          projectile-indexing-method 'alien
          projectile-sort-order 'recentf
          projectile-project-search-path '("~/git/" "~/work/" "~/Research/")
          projectile-known-projects-file (expand-file-name ".cache/projectile-bookmarks.eld" user-emacs-directory)
          projectile-cache-file (expand-file-name ".cache/projectile.cache" user-emacs-directory))))

(use-package counsel-projectile
  :after (counsel projectile)
  :config (counsel-projectile-mode 1))

;; ── General (all keybindings) ──
(use-package general
  :demand t
  :config
  (general-define-key
   :prefix "SPC"
   :states '(normal visual motion)
   :keymaps 'override

   "f n" '(make-frame-command :wk "make frame")

   ;; Files & Buffers
   "f f" '(counsel-find-file :wk "Find file")
   "f s" '(save-buffer :wk "Save file")
   "f r" '(counsel-recentf :wk "Recent files")
   "b b" '(ivy-switch-buffer :wk "Switch buffer")
   "b k" '(kill-this-buffer :wk "Kill buffer")

   ;; Projects
   "p" '(:ignore t :wk "Projects")
   "p p" '(counsel-projectile-switch-project :wk "Switch project")
   "p f" '(counsel-projectile-find-file :wk "Find file in project")
   "p d" '(counsel-projectile-find-dir :wk "Find dir in project")
   "p b" '(counsel-projectile-switch-to-buffer :wk "Switch project buffer")
   "p s" '(counsel-projectile-rg :wk "Search in project")
   "p r" '(projectile-recentf :wk "Recent project files")
   "p i" '(projectile-invalidate-cache :wk "Invalidate cache")
   "p k" '(projectile-kill-buffers :wk "Kill project buffers")
   "p S" '(projectile-save-project-buffers :wk "Save project buffers")

   ;; Search
   "s" '(:ignore t :wk "Search")
   "s s" '(swiper :wk "Search buffer")
   "s p" '(counsel-projectile-rg :wk "Search project")
   "s d" '(counsel-ag :wk "Search directory")
   "s f" '(counsel-find-file :wk "Find files")
   "s g" '(counsel-git-grep :wk "Git grep")

   ;; Dashboard
   "d" '(:ignore t :wk "Dashboard")
   "d d" '(dashboard-refresh-buffer :wk "Open dashboard")
   "d p" '(dashboard-goto-projects :wk "Go to projects")
   "d r" '(dashboard-goto-recent-files :wk "Go to recent files")

   ;; Windows
   "w h" '(evil-window-left :wk "Left")
   "w j" '(evil-window-down :wk "Down")
   "w k" '(evil-window-up :wk "Up")
   "w l" '(evil-window-right :wk "Right")
   "w s" '(evil-window-split :wk "Split below")
   "w v" '(evil-window-vsplit :wk "Split right")
   "w d" '(delete-window :wk "Delete window")
   "w m" '(delete-other-windows :wk "Maximize")

   ;; Org Mode
   "o a" '(org-agenda :wk "Agenda")
   "o c" '(org-capture :wk "Capture")
   "o t" '(org-babel-tangle :wk "Tangle")

   ;; Eglot / Code
   "c" '(:ignore t :wk "Code/Eglot")
   "c r" '(eglot-rename :wk "Rename")
   "c a" '(eglot-code-actions :wk "Code action")
   "c f" '(eglot-format-buffer :wk "Format buffer")
   "c g" '(:ignore t :wk "Go to")
   "c g d" '(xref-find-definitions :wk "Definition")
   "c g r" '(xref-find-references :wk "References")
   "c g i" '(eglot-find-implementation :wk "Implementation")
   "c g t" '(eglot-find-typeDefinition :wk "Type definition")
   "c s" '(consult-eglot-symbols :wk "Workspace symbol")
   "c d" '(eldoc-box-help-at-point :wk "Describe at point")
   "c e" '(flymake-show-buffer-diagnostics :wk "Show errors")
   "c E" '(flymake-show-project-diagnostics :wk "Project errors")
   "c R" '(eglot-reconnect :wk "Restart server")
   "c q" '(eglot-shutdown :wk "Shutdown server")

   ;; Reload
   "h r r" '(my-reload-init-file :wk "Reload")

   ;; Terminal
   "t t" '(vterm :wk "Terminal")

   ;; Git
   "g g" '(magit-status :wk "Magit")

   ;; File tree
   "e" '(neotree-toggle :wk "neotree")

   ;; Typst
   "m c" '(my-typst-compile-and-view :wk "Compile & view Typst")
   "m w" '(my-typst-watch-toggle :wk "Toggle watch mode")
   "m v" '(my-typst-view-pdf :wk "View PDF")

   ;; LaTeX Preview
   "l" '(:ignore t :wk "LaTeX")
   "l p" '(my-latex-preview-toggle :wk "Preview LaTeX")
   "l r" '(texfrag-document :wk "Render all (texfrag)")
   "l c" '(texfrag-clear-document :wk "Clear previews")

   ;; Help
   "h k" '(describe-key :wk "Describe key")
   "h v" '(describe-variable :wk "Describe variable")
   "h f" '(describe-function :wk "Describe function")

   ;; Buffer navigation
   "[" '(previous-buffer :wk "Previous buffer")
   "]" '(next-buffer :wk "Next buffer")

   ;; View & Zen Mode
   "v" '(:ignore t :wk "View/Zen")
   "v f" '(toggle-fullscreen :wk "Fullscreen")
   "v z" '(my-zen-mode :wk "Zen mode")
   "v l" '(my-zen-mode-light :wk "Zen light")
   "v u" '(my-zen-mode-ultra :wk "Ultra zen")
   "v n" '(display-line-numbers-mode :wk "Toggle line numbers")

   ;; Other
   "SPC" '(counsel-projectile :wk "Find in project")
   "q q" '(save-buffers-kill-terminal :wk "Quit")
   "/" '(comment-line :wk "Comment")

   ;; Denote
   "n n" '(denote-open-or-create :wk "Denote")
   "n l" '(denote-link :wk "Denote link")
   "n L" '(denote-add-links :wk "Denote add links")))
#+end_src

* Terminal
#+begin_src emacs-lisp
(use-package vterm
  :commands vterm
  :config (setq vterm-max-scrollback 10000 vterm-buffer-name-string "vterm: %s"))

(add-to-list 'display-buffer-alist
             '("\\*vterm\\*" (display-buffer-at-bottom) (window-height . 0.3) (dedicated . t)))
#+end_src

* Completion & Development
#+begin_src emacs-lisp
(use-package csv-mode :mode "\\.csv\\'")

;; ── Company ──
(use-package company
  :hook (after-init . global-company-mode)
  :config
  (setq company-idle-delay 0.2
        company-minimum-prefix-length 2
        company-tooltip-align-annotations t)
  :bind (:map company-active-map
              ("C-n" . company-select-next)
              ("C-p" . company-select-previous)
              ("<tab>" . company-complete-common-or-cycle)))

(use-package company-box
  :if (display-graphic-p)
  :hook (company-mode . company-box-mode)
  :config (setq company-box-show-single-candidate t company-box-doc-enable t))

(use-package eldoc-box
  :commands eldoc-box-help-at-point
  :config (setq eldoc-box-max-pixel-width 800 eldoc-box-max-pixel-height 600 eldoc-box-clear-with-C-g t))

;; ── Snippets ──
(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
  :config
  (let ((snippet-dir "~/.emacs.d/snippets"))
    (when (file-directory-p snippet-dir)
      (setq yas-snippet-dirs (list snippet-dir))))
  (yas-reload-all))
(use-package yasnippet-snippets :after yasnippet)

;; ── Eglot (built-in LSP) ──
(use-package eglot
  :straight (:type built-in)
  :hook ((python-mode python-ts-mode
          typescript-mode typescript-ts-mode tsx-ts-mode
          js-mode js-ts-mode c-mode c++-mode go-mode
          typst-ts-mode) . eglot-ensure)
  :config
  ;; Fix nil markup crash
  (advice-add 'eglot--format-markup :filter-args
              (lambda (args) (if (car args) args '(""))))
  (setq eglot-autoshutdown t
        eglot-events-buffer-size 0
        eglot-sync-connect nil
        eglot-connect-timeout 60
        eldoc-echo-area-use-multiline-p nil)
  (add-to-list 'eglot-server-programs '(typst-ts-mode . ("typst-lsp")))
  (add-to-list 'eglot-server-programs '(rust-mode . ("rust-analyzer")))
  (add-to-list 'eglot-server-programs '(rustic-mode . ("rust-analyzer")))
  (fset #'jsonrpc--log-event #'ignore))

;; ── Formatting ──
(use-package apheleia :hook (prog-mode . apheleia-mode))

;; ── Flycheck ──
(use-package flycheck :hook (prog-mode . flycheck-mode))

;; ── Git ──
(use-package magit :commands magit-status)

;; ── Treemacs ──
(use-package treemacs :defer t :config (setq treemacs-width 30))
(use-package treemacs-evil :after (treemacs evil))
(use-package treemacs-projectile :after (treemacs projectile))
#+end_src

* Programming Languages
#+begin_src emacs-lisp
;; Tree-sitter
(straight-use-package 'tree-sitter)
(straight-use-package 'tree-sitter-langs)
(require 'tree-sitter)
(require 'tree-sitter-langs)

(use-package markdown-mode
  :mode ("README\\.md\\'" . markdown-mode)
  :init (setq markdown-command "multimarkdown"))

;; ── Typst ──
(defvar my-typst-watch-process nil)

(defun my-typst-compile-and-view ()
  "Compile current Typst file and open PDF."
  (interactive)
  (when buffer-file-name
    (save-buffer)
    (call-process "typst" nil nil nil "compile" buffer-file-name)
    (let ((pdf (concat (file-name-sans-extension buffer-file-name) ".pdf")))
      (when (file-exists-p pdf)
        (call-process (if (eq system-type 'darwin) "open" "xdg-open") nil nil nil pdf)))))

(defun my-typst-watch-toggle ()
  "Toggle typst watch mode."
  (interactive)
  (if (and my-typst-watch-process (process-live-p my-typst-watch-process))
      (progn (kill-process my-typst-watch-process)
             (setq my-typst-watch-process nil)
             (message "Typst watch stopped"))
    (when buffer-file-name
      (save-buffer)
      (setq my-typst-watch-process
            (start-process "typst-watch" "*typst-watch*" "typst" "watch" "--open" buffer-file-name))
      (message "Typst watch started"))))

(defun my-typst-view-pdf ()
  "View PDF for current Typst file."
  (interactive)
  (when buffer-file-name
    (let ((pdf (concat (file-name-sans-extension buffer-file-name) ".pdf")))
      (if (file-exists-p pdf)
          (call-process (if (eq system-type 'darwin) "open" "xdg-open") nil nil nil pdf)
        (message "PDF not found. Compile first with SPC m c")))))

(use-package typst-ts-mode
  :straight (:type git :host sourcehut :repo "meow_king/typst-ts-mode")
  :mode "\\.typ\\'"
  :config (setq typst-ts-mode-watch-options "--open" typst-ts-mode-compile-options ""))

;; ── Python ──
(use-package pyvenv :hook (python-ts-mode . pyvenv-mode))

;; ── Rust ──
(setq rustic-lsp-client 'eglot)
(use-package rustic
  :demand t
  :mode ("\\.rs\\'" . rustic-mode)
  :hook (rustic-mode . eglot-ensure)
  :config
  (setq rustic-format-on-save nil
        rustic-analyzer-command '("rust-analyzer")
        rustic-mode-use-ts-mode t))

#+end_src


** Agent shell
#+begin_src emacs-lisp
(use-package agent-shell
    :straight t
    :ensure-system-package
    ;; Add agent installation configs here
    ((claude . "brew install claude-code")
     (claude-agent-acp . "npm install -g @zed-industries/claude-agent-acp"))

:config
  ;; Evil state-specific RET behavior: insert mode = newline, normal mode = send
  (evil-define-key 'insert agent-shell-mode-map (kbd "RET") #'newline)
  (evil-define-key 'normal agent-shell-mode-map (kbd "RET") #'comint-send-input)

  ;; Configure *agent-shell-diff* buffers to start in Emacs state
  (add-hook 'diff-mode-hook
	    (lambda ()
	      (when (string-match-p "\\*agent-shell-diff\\*" (buffer-name))
		(evil-emacs-state))))

    )
#+end_src

** Xcode setup
#+begin_src emacs-lisp

(use-package swift-mode
  :straight t)

(use-package swift-development
  :straight (:type git :host github :repo "konrad1977/swift-development"))

;; Load the main package
(require 'swift-development)
(require 'xcode-project)
(require 'xcode-build-config)

;; Optional modules
(require 'ios-simulator)
(require 'ios-device)
(require 'swift-refactor)
(require 'localizeable-mode)
#+end_src

* Org Mode
#+begin_src emacs-lisp
(use-package htmlize :defer t)
(use-package org-fragtog :hook (org-mode . org-fragtog-mode))
(use-package org-auto-tangle :defer t :hook (org-mode . org-auto-tangle-mode))

(use-package ox-typst
  :after org
  :config
  (setq org-typst-from-latex-environment #'org-typst-from-latex-with-naive
        org-typst-from-latex-fragment #'org-typst-from-latex-with-naive))

;; Clean org UI
(setq org-hide-emphasis-markers t
      org-format-latex-options (plist-put org-format-latex-options :scale 1.5))

(with-eval-after-load 'org
  (setq org-directory (expand-file-name "~/org")
        org-default-notes-file (concat org-directory "/inbox.org")
        org-agenda-files (list org-directory))
  (make-directory org-directory t)

  (setq org-display-inline-images t
        org-redisplay-inline-images t
        org-ellipsis "..."
        org-log-done 'time
        org-startup-indented t
        org-startup-folded 'content)

  (use-package org-superstar
    :hook (org-mode . org-superstar-mode)
    :config (setq org-superstar-headline-bullets-list '(" " " " " " " ")))

  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "WAIT(w)" "|" "DONE(d)" "CANCELLED(c)")))

  (setq org-capture-templates
        '(("t" "Todo" entry (file+headline org-default-notes-file "Tasks")
           "* TODO %?\n  %i\n  %a")
          ("n" "Note" entry (file+headline org-default-notes-file "Notes")
           "* %?\n  %i\n  %a")))

  (setq org-src-tab-acts-natively t
        org-src-fontify-natively t
        org-src-preserve-indentation t
        org-edit-src-content-indentation 0)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t) (python . t) (ditaa . t) (shell . t))))

(setq org-ditaa-jar-path "/opt/homebrew/bin/ditaa"
      org-babel-python-command "/opt/homebrew/bin/python3")

(use-package evil-org
  :after (org evil)
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

;; ── Denote ──
(use-package denote
  :commands (denote denote-link denote-backlinks)
  :hook (dired-mode . denote-dired-mode)
  :bind (("C-c n n" . denote) ("C-c n r" . denote-rename-file)
         ("C-c n l" . denote-link) ("C-c n b" . denote-backlinks))
  :config
  (setq denote-directory (expand-file-name "~/Documents/notes/"))
  (denote-rename-buffer-mode 1))

;; ── Export backends ──
(use-package ox-hugo :after ox)

(with-eval-after-load 'ox-latex
  (setq org-latex-listings 'minted)
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (add-to-list 'org-latex-packages-alist '("" "listings"))
  (add-to-list 'org-latex-packages-alist '("" "color"))
  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (add-to-list 'org-latex-classes
               '("ieee" "\\documentclass{IEEEtran}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

;; ── Jupyter ──
(use-package jupyter
  :defer t
  :config
  (setq jupyter-server-use-environment-path t)
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     (append org-babel-load-languages '((jupyter . t))))))

;; ── Slides ──
(use-package org-tree-slide)
(use-package ox-reveal)
#+end_src

* LaTeX
#+begin_src emacs-lisp
;; ── AUCTeX ──
(use-package auctex
  :defer t
  :hook (LaTeX-mode . (lambda () (reftex-mode t) (flyspell-mode t) (LaTeX-math-mode t)))
  :config
  (setq TeX-auto-save t TeX-parse-self t TeX-PDF-mode t TeX-master nil
        TeX-source-correlate-mode t TeX-source-correlate-method 'synctex))

(use-package reftex :defer t :config (setq reftex-plug-into-AUCTeX t))

;; ── Citar ──
(use-package citar
  :custom (citar-bibliography '("~/Documents/Research Projects/bib/references.bib"))
  :hook ((LaTeX-mode org-mode) . citar-capf-setup))

;; ── texfrag (LaTeX preview in any buffer) ──
(use-package texfrag
  :commands (texfrag-mode texfrag-document texfrag-clear-document)
  :config (define-key texfrag-mode-map (kbd "C-c C-x C-l") 'texfrag-document))

(defvar-local my-texfrag-previews-active nil)

(defun my-latex-preview-toggle ()
  "Toggle LaTeX preview in current buffer."
  (interactive)
  (cond
   ((derived-mode-p 'org-mode) (call-interactively 'org-latex-preview))
   ((bound-and-true-p texfrag-mode)
    (if my-texfrag-previews-active
        (progn (texfrag-clear-document) (setq my-texfrag-previews-active nil) (message "Previews cleared"))
      (progn (texfrag-document) (setq my-texfrag-previews-active t) (message "Previews rendered"))))
   (t (message "Enable texfrag-mode first (M-x texfrag-mode)"))))

(global-set-key (kbd "C-c l p") 'my-latex-preview-toggle)
#+end_src

* PDF Support
#+begin_src emacs-lisp
(use-package pdf-tools
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install :no-query)
  (setq-default pdf-view-display-size 'fit-width)
  (add-hook 'pdf-view-mode-hook
            (lambda ()
              (setq pdf-view-midnight-colors
                    `(,(face-foreground 'default) . ,(face-background 'default)))
              (pdf-view-midnight-minor-mode))))
#+end_src

#+begin_src emacs-lisp
(message "Init loaded successfully!")
#+end_src
